## Plan Result (sds_prod_acr - TerraformPlanApply)




<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_container_registry.container_registry[&#34;sdshmctspublic&#34;]
  * azurerm_resource_group.sds_acr_resource_group
  * azurerm_role_assignment.acr_access




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_container_registry.container_registry["sdshmctspublic"] will be created
  + resource "azurerm_container_registry" "container_registry" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "uksouth"
      + login_server                  = (known after apply)
      + name                          = "sdshmctspublic"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "sds-acr-rg"
      + retention_policy_in_days      = 1
      + sku                           = "Premium"
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/acr-build-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + trust_policy_enabled          = false
      + zone_redundancy_enabled       = false
    }

  # azurerm_resource_group.sds_acr_resource_group will be created
  + resource "azurerm_resource_group" "sds_acr_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "sds-acr-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/acr-build-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # azurerm_role_assignment.acr_access will be created
  + resource "azurerm_role_assignment" "acr_access" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d067416c-5ac7-4289-aa38-c1c9bb5800aa"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":18,"Program":"tfcmt","SHA1":"","Target":"sds_prod_acr - TerraformPlanApply","Vars":{}} -->